In [1]:
import pandas as pd
from sqlalchemy import create_engine

engine = create_engine('mysql+pymysql://root:@localhost:3306/stock')
con = engine.connect()
engine = create_engine('mysql+pymysql://root:@localhost:3306/portfolio_development')
conpf = engine.connect()
engine = create_engine('sqlite:///c:\\ruby\\port_lite\\db\\development.sqlite3')
conlite = engine.connect()
engine = create_engine('sqlite:///c:\\ruby\\portlt\\db\\development.sqlite3')
conlt = engine.connect()
engine = create_engine('sqlite:///c:\\ruby\\portmy\\db\\development.sqlite3')
conmy = engine.connect()
engine = create_engine('postgresql+psycopg2://postgres:admin@localhost:5432/portpg_development')
conpg = engine.connect()

### Par change

In [2]:
name = 'AIT'
old_par= 5.00
new_par = 1.00
ratio = 5
effective_date = '2022-01-04'

### Price table

In [3]:
sql = """
SELECT *
FROM price
WHERE name = '%s'
"""
sql = sql % (name)
price = pd.read_sql(sql, con)
price.shape

(1476, 7)

In [4]:
sql = """
UPDATE price
SET price = price/%s, maxp=maxp/%s, minp=minp/%s, qty=qty*%s, opnp=opnp/%s
WHERE name = '%s' AND date < '%s'
"""
sql = sql % (ratio, ratio, ratio, ratio, ratio, name, effective_date)
print(sql)

UPDATE price
SET price = price/5, maxp=maxp/5, minp=minp/5, qty=qty*5, opnp=opnp/5
WHERE name = 'AIT' AND date < '2022-01-04'

In [5]:
rp = con.execute(sql)
rp.rowcount

1376

### Buy table

In [6]:
sql = """
SELECT *
FROM buy
WHERE name = '%s'
"""
sql = sql % (name)
price = pd.read_sql(sql, con)
price.shape

(0, 10)

### Dividend table

In [7]:
sql = """
SELECT *
FROM dividend
WHERE name = '%s'
"""
sql = sql % (name)
price = pd.read_sql(sql, con)
price

Empty DataFrame
Columns: [NAME, Q4, Q3, Q2, Q1, DIVIDEND, PRICE, PERCENT, SHARES, XDATE, PAIDDATE, KIND, ACTUAL]
Index: []

In [12]:
sql = """
UPDATE dividend
SET Q4 = Q4/%s, Q3 = Q3/%s, Q2 = Q2/%s, Q1 = Q1/%s, DIVIDEND=DIVIDEND/%s
WHERE name = '%s'
"""
sql = sql % (ratio, ratio, ratio, ratio, ratio,  name)
print(sql)

UPDATE dividend
SET Q4 = Q4/2, Q3 = Q3/2, Q2 = Q2/2, Q1 = Q1/2, DIVIDEND=DIVIDEND/2
WHERE name = 'TQM'

In [13]:
rp = con.execute(sql)
rp.rowcount

1

### EPSS table

In [8]:
sql = """
SELECT *
FROM epss
WHERE name = '%s'
"""
sql = sql % (name)
epss = pd.read_sql(sql, conlt)
epss.shape

(45, 14)

In [9]:
sql = """
UPDATE epss
SET q_eps = q_eps/%s, y_eps = y_eps/%s, aq_eps = aq_eps/%s, ay_eps = ay_eps/%s
WHERE name = '%s'
"""
sql = sql % (ratio, ratio, ratio, ratio, name)
print(sql)

UPDATE epss
SET q_eps = q_eps/5, y_eps = y_eps/5, aq_eps = aq_eps/5, ay_eps = ay_eps/5
WHERE name = 'AIT'

In [10]:
rp = conlt.execute(sql)
rp.rowcount

45

In [11]:
rp = conpg.execute(sql)
rp.rowcount

45

### CONSENSUS table

In [12]:
sql = """
SELECT *
FROM consensus
WHERE name = '%s'
"""
sql = sql % (name)
epss = pd.read_sql(sql, conlt)
epss.columns

Index(['id', 'name', 'price', 'buy', 'hold', 'sell', 'eps_a', 'eps_b', 'pe',
       'pbv', 'yield', 'target_price', 'status', 'ticker_id', 'created_at',
       'updated_at'],
      dtype='object')

In [13]:
sql = """
UPDATE consensus
SET price = price/%s, eps_a = eps_a/%s, eps_b = eps_b/%s, target_price = target_price/%s
WHERE name = '%s'
"""
sql = sql % (ratio, ratio, ratio, ratio, name)
print(sql)

UPDATE consensus
SET price = price/5, eps_a = eps_a/5, eps_b = eps_b/5, target_price = target_price/5
WHERE name = 'AIT'

In [14]:
rp = conlt.execute(sql)
rp.rowcount

1

In [15]:
rp = conmy.execute(sql)
rp.rowcount

1

In [16]:
rp = conpg.execute(sql)
rp.rowcount

1

### Portfolio database

In [17]:
sql = """
SELECT *
FROM buys JOIN stocks ON buys.stock_id = stocks.id
WHERE name = '%s'
"""
sql = sql % (name)
buys = pd.read_sql(sql, conpf)
buys

Empty DataFrame
Columns: [id, stock_id, date, qty, price, fee, vat, status, net, kind, chart, id, name, category_id, website]
Index: []

In [29]:
sql = """
UPDATE buys
SET price = price/%s, qty = qty*%s
WHERE stock_id = 181
"""
sql = sql % (ratio, ratio)
print(sql)

UPDATE buys
SET price = price/2, qty = qty*2
WHERE stock_id = 181

In [30]:
rp = conpf.execute(sql)
rp.rowcount

2

In [18]:
sql = """
SELECT *
FROM sells LIMIT 1"""
df_tmp = pd.read_sql(sql, conpf)
df_tmp.columns

Index(['id', 'buy_id', 'date', 'price', 'fee', 'vat', 'net', 'days', 'profit',
       'percent', 'yearly', 'sequence', 'chart', 'dividend_id'],
      dtype='object')

In [19]:
sql = """
SELECT *
FROM sells JOIN buys ON sells.buy_id = buys.id
JOIN stocks ON buys.stock_id = stocks.id
WHERE name = '%s'
"""
sql = sql % (name)
sells = pd.read_sql(sql, conpf)
sells

Empty DataFrame
Columns: [id, buy_id, date, price, fee, vat, net, days, profit, percent, yearly, sequence, chart, dividend_id, id, stock_id, date, qty, price, fee, vat, status, net, kind, chart, id, name, category_id, website]
Index: []

[0 rows x 29 columns]

In [33]:
sql = '''
UPDATE sells
SET price = price/%s
WHERE buy_id IN (990, 899)
'''
sql = sql % (ratio)
print(sql)

UPDATE sells
SET price = price/2
WHERE buy_id IN (990, 899)

In [34]:
rp = conpf.execute(sql)
rp.rowcount

2

### Sales table in Portfolio database

In [32]:
pd.read_sql_query('SELECT * FROM sales LIMIT 1', conlite)

,id,name,fm_date,to_date,days,fm_price,to_price,diff,pct,ttl_spread,avg_spread,max_price,min_price,qty,created_at,updated_at,latest_date_id
0,1133235,AIT,2021-06-02,2021-06-04,2,22,21.9,-0.1,-0.45,-1,-1,22.1,21.9,334878,2022-06-03 17:11:36.671848,2022-06-03 17:11:36.671848,1

In [ ]:
pd.read_sql_query('SELECT * FROM sells limit 1', conpf)

In [38]:
sql = """
UPDATE sales
SET fm_price = fm_price/%s, to_price = to_price/%s, max_price = max_price/%s, min_price = min_price/%s, qty=qty*%s
WHERE name = '%s' AND to_date < '%s'
"""
sql = sql % (ratio, ratio, ratio, ratio, ratio, name, effective_date)
print(sql)

UPDATE sales
SET fm_price = fm_price/5, to_price = to_price/5, max_price = max_price/5, min_price = min_price/5, qty=qty*5
WHERE name = 'AIT' AND to_date < '2022-01-04'

In [39]:
rp = conlite.execute(sql)
rp.rowcount

60

### End of Process